
## 1. **Pendahuluan** ğŸ—‚ï¸

### 1.1 Pendahuluan ğŸ¯

Modul â€œDasar CLI pada Perangkat Ciscoâ€ ini akan membantu kamu:

- ğŸ”Œ **Memahami** apa itu CLI dan cara mengaksesnya.
    
- âš™ï¸ **Mengenali** modeâ€‘mode operasi di CLI.
    
- ğŸ› ï¸ **Belajar** perintah dasar konfigurasi, penyimpanan, dan troubleshooting.
    

**Petunjuk Penggunaan** ğŸ“˜

1. Baca setiap subâ€‘bab berurutan.
    
2. Praktikkan langsung pada perangkat atau emulator (PacketTracer/GNS3).
    
3. Kerjakan latihan di akhir modul untuk memperkuat pemahaman.
    

---

## 2. **Isi Inti** ğŸ“š

### 2.1 Apa itu CLI? ğŸ’»

**Commandâ€‘Line Interface (CLI)** adalah antarmuka teks yang memungkinkan kamu mengonfigurasi dan mengelola perangkat jaringan Cisco secara langsung. CLI hanya memerlukan terminal (Putty, TeraTerm) dan kabel console (RJâ€‘45 â†’ USB atau miniâ€‘USB).

**Cara Akses CLI:**

- **Port Console:** Kabel rollover (RJâ€‘45 ke DBâ€‘9) â†’ adapter USB â†’ komputer.
    
- **SSH/Telnet:** Setelah perangkat terâ€‘IP, buka Putty â†’ pilih SSH â†’ masukkan IP & port.
    

---

### 2.2 Navigasi & Bantuan di CLI ğŸ†˜

- **`?`** â€“ Tampilkan daftar perintah atau parameter ketika ragu.
    
- **`<Tab>`** â€“ Autoâ€‘lengkapi perintah jika sebagian sudah diketik.
    
- **`Ctrl+Z`** â€“ Kembali ke privileged exec mode dari mode konfigurasi.
    
- **`Ctrl+C`** â€“ Batal perintah yang sedang diketik.
    

---

### 2.3 Mode Operasi CLI âš™ï¸

| Mode                     | Prompt                                       | Fungsi                                              |
| ------------------------ | -------------------------------------------- | --------------------------------------------------- |
| **User Exec**            | `Router>`                                    | Lihat status & statistik, tidak untuk konfigurasi.  |
| **Privileged Exec**      | `Router#`                                    | Akses perintah debugging & konfigurasi lanjutan.    |
| **Global Configuration** | `Router(config)#`                            | Ubah konfigurasi perangkat secara keseluruhan.      |
| **Subâ€‘Configuration**    | `Router(config-if)#`, `Router(config-line)#` | Konfigurasi interface, line, routing protocol, dll. |

**Pindah Mode:**

```shell
Router> enable             â† ke Privileged Exec  
Router# configure terminal â† ke Global Configuration  
Router(config)# interface GigabitEthernet0/0  â† ke Interface Config  
```

---

### 2.4 Perintah Dasar Konfigurasi ğŸ› ï¸

1. **Set Password & Keamanan**
    
    ```shell
    Router(config)# enable password ccna  
    Router(config)# enable secret Cisco123    â† lebih aman (terâ€‘hash)  
    Router(config)# service password-encryption â† encrypt semua password plain-text  
    ```
    
    - `enable password` hanya enkripsi sederhana.
        
    - `enable secret` menggunakan MD5 hash, lebih sulit diâ€‘buka.
        
2. **Mengelola Konfigurasi**
    
    - **Runningâ€‘Config**: konfigurasi aktif di RAM.
        
        ```shell
        Router# show running-config
        ```
        
    - **Startupâ€‘Config**: konfigurasi yang akan dimuat saat restart (NVRAM).
        
        ```shell
        Router# show startup-config
        ```
        
3. **Menyimpan & Memuat Konfigurasi**
    
    ```shell
    Router# write memory      â† simpan running-config ke startup-config  
    Router# copy running-config startup-config  
    ```
    
4. **Membatalkan Perintah**
    
    - Tambahkan `no` di depan perintah untuk menghapus atau menonaktifkan:
        
        ```shell
        Router(config)# no interface GigabitEthernet0/1  
        Router(config)# no ip routing  
        ```
        

---

### 2.5 Contoh Kasus & Praktik ğŸ“

> **Skenario:**  
> Kamu ingin mengamankan akses ke router dan menyimpan konfigurasi dasar.
> 
> **Langkahâ€‘langkah:**
> 
> 1. Akses CLI via console â†’ masuk ke Privileged Exec (`enable`).
>     
> 2. Masuk ke Global Configuration (`configure terminal`).
>     
> 3. Set password:
>     
>     ```shell
>     Router(config)# enable secret MyS3cret!
>     Router(config)# service password-encryption
>     ```
>     
> 4. Verifikasi:
>     
>     ```shell
>     Router# show running-config | include secret
>     ```
>     
> 5. Simpan konfigurasi:
>     
>     ```shell
>     Router# write memory
>     ```
>     

---

### 2.6 Latihan & Evaluasi âœ…

1. **Praktik:** Hubungkan ke router via Putty, ubah prompt menjadi menampilkan nama host, lalu simpan konfigurasi.
    
2. **Soal Teori:** Jelaskan perbedaan `enable password` vs `enable secret`!
    
3. **Troubleshoot:** Coba batalkan konfigurasi interface FastEthernet0/0 dengan perintah `no`, lalu cek hasilnya.
    

---

## 3. **Penutup** ğŸ“

### 3.1 Rangkuman âœ¨

- CLI memungkinkan konfigurasi langsung perangkat Cisco lewat terminal.
    
- Tiga mode utama: User Exec (`>`), Privileged Exec (`#`), Global Configuration (`(config)#`).
    
- Perintah dasar meliputi set password, show running-config, dan save config.
    
- Gunakan `?`, `<Tab>`, & `no` untuk bantuan, autoâ€‘lengkapi, dan membatalkan perintah.
    

### 3.2 Daftar Pustaka & Referensi ğŸ“š

1. Cisco Systems. _Cisco IOS Command Reference_.
    
2. Odom, W. _CCNA Routing and Switching 200-125 Official Cert Guide_.
    

### 3.3 Glosarium ğŸ“–

- **CLI**: Commandâ€‘Line Interface.
    
- **Rollover Cable**: Kabel console Cisco.
    
- **Runningâ€‘Config**: Konfigurasi aktif.
    
- **Startupâ€‘Config**: Konfigurasi saat boot.
    

### 3.4 Lampiran ğŸ“

- **Tabel Prompt & Mode** (ringkasan).
    
- **Diagram Alur Mode CLI**.
    

---
